Revit 2027 API
ServiceType Enumeration
 This enumeration is used for specifying the most predominant service for the building or space.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ServiceType
Public Enumeration ServiceType
public enum class ServiceType
type ServiceType
Members
Member name | Value | Description
kActiveChilledBeams | 22 | Service Type is ActiveChilledBeams.
kCentralHeatingConvectors | 1 | Service Type is CentralHeatingConvectors.
kCentralHeatingHotAir | 3 | Service Type is CentralHeatingHotAir.
kCentralHeatingRadiantFloor | 2 | Service Type is CentralHeatingRadiantFloor.
kCentralHeatingRadiators | 0 | Service Type is CentralHeatingRadiators.
kConstantVolumeDualDuct | 20 | Service Type is ConstantVolumeDualDuct.
kConstantVolumeFixedOA | 16 | Service Type is ConstantVolumeFixedOA.
kConstantVolumeTerminalReheat | 18 | Service Type is ConstantVolumeTerminalReheat.
kConstantVolumeVariableOA | 17 | Service Type is ConstantVolumeVariableOA.
kFanCoilSystem | 14 | Service Type is FanCoilSystem.
kForcedConvectionHeaterFlue | 8 | Service Type is ForcedConvectionHeaterFlue.
kForcedConvectionHeaterNoFlue | 9 | Service Type is ForcedConvectionHeaterNoFlue.
kInductionSystem | 15 | Service Type is InductionSystem.
kMultizoneHotDeckColdDeck | 19 | Service Type is MultizoneHotDeckColdDeck.
kNoServiceType | -1 | Service Type is NoServiceType.
kOtherRoomHeater | 4 | Service Type is OtherRoomHeater.
kRadiantCooledCeilings | 21 | Service Type is RadiantCooledCeilings.
kRadiantHeaterFlue | 5 | Service Type is RadiantHeaterFlue.
kRadiantHeaterMultiburner | 7 | Service Type is RadiantHeaterMultiburner.
kRadiantHeaterNoFlue | 6 | Service Type is RadiantHeaterNoFlue.
kSplitSystemsWithMechanicalVentilation | 26 | Service Type is SplitSystemsWithMechanicalVentilation.
kSplitSystemsWithMechanicalVentilationWithCooling | 27 | Service Type is SplitSystemsWithMechanicalVentilationWithCooling.
kSplitSystemsWithNaturalVentilation | 25 | Service Type is SplitSystemsWithNaturalVentilation.
kVariableRefrigerantFlow | 24 | Service Type is VariableRefrigerantFlow.
kVAVDualDuct | 11 | Service Type is VAVDualDuct.
kVAVIndoorPackagedCabinet | 12 | Service Type is VAVIndoorPackagedCabinet.
kVAVSingleDuct | 10 | Service Type is VAVSingleDuct.
kVAVTerminalReheat | 13 | Service Type is VAVTerminalReheat.
kWaterLoopHeatPump | 23 | Service Type is WaterLoopHeatPump.
Remarks
 This enumerated list corresponds to the serviceType attribute in the gbXML (Green Building XML) schema and is primarily used for energy analysis.
See Also
Reference
Autodesk.Revit.DB Namespace